The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId NetworkCanNotDeterminCriticalPath { get; }
  Visual Basic
Public Shared ReadOnly Property NetworkCanNotDeterminCriticalPath As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NetworkCanNotDeterminCriticalPath {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace